Documents/упВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упВводНачальныхОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упАгрегатыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.упОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперацииВводаНачальныхОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОперацийВводаНачальныхОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Агрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительноеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
								<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаправкаСливГСМ</v8:Type>
								<v8:Type>cfg:DocumentRef.упПоступлениеМатериалов</v8:Type>
								<v8:Type>cfg:DocumentRef.упКорректировкаОстатковМатериалов</v8:Type>
								<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Comment>Сумма в валюте управленческого учета, без НДС </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Comment>Сумма в валюте управленческого учета, с НДС </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упТипыОперацийВводаНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыОперацийВводаНачальныхОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОстаткиАгрегатовНаСкладах</Name>
					<Comment>Ввод начальных остатков агрегатов на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиМатериаловНаСкладах</Name>
					<Comment>Ввод начальных остатков материалов на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиОборудованияНаСкладах</Name>
					<Comment>Ввод начальных остатков по дополнительному оборудованию на складах</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упВводНачальныхОстатков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ИспользуетсяУчетДополнительногоОборудования 	= ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования");
	ИспользуетсяУчетШинУзловИАгрегатов			= ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов");
	
	ШаблонПредставления = Нстр("ru = '%1 %2 от %3'");
	КомментарийТипаОперации = "";
	ИндексТипаОперации = Перечисления.упТипыОперацийВводаНачальныхОстатков.Индекс(Данные.ТипОперацииВводаНачальныхОстатков);
	Если ИндексТипаОперации <> -1 Тогда
		КомментарийТипаОперации = Данные.ТипОперацииВводаНачальныхОстатков.Метаданные().ЗначенияПеречисления.Получить(ИндексТипаОперации).Комментарий;	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(КомментарийТипаОперации) Тогда
		КомментарийТипаОперации = Нстр("ru = 'Ввод начальных остатков'")
	КонецЕсли;
	Представление = СтрШаблон(ШаблонПредставления, КомментарийТипаОперации, Данные.Номер, Данные.Дата);
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ТипОперацииВводаНачальныхОстатков");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
    Результат = Новый Массив;
    Результат.Добавить("Организация");
    Результат.Добавить("Склад");
    Результат.Добавить("Валюта");
    Возврат Результат;
КонецФункции

#КонецОбласти

#Область Проведение

// Заполнение дополнительных свойств документа.
//
Процедура ИнициализироватьДанныеДокумента(ДокументОбъект, ДополнительныеСвойства) Экспорт
	
	ИмяТабличнойЧасти  = "Материалы";
	ИмяТаблицыОстатков = "ОстаткиМатериалов";
	ТипОперацииВводаНачальныхОстатков = ДокументОбъект.ТипОперацииВводаНачальныхОстатков;
	Склад = ДокументОбъект.Склад;
		
	Если ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиАгрегатовНаСкладах Тогда
		ИмяТабличнойЧасти  = "Агрегаты";
		ИмяТаблицыОстатков = "ОстаткиАгрегатов";
		
		тбзОстатки = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
		тбзОстатки.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.упСклады"));
		Для каждого Строка Из тбзОстатки Цикл
			Строка.Склад = Склад;
		КонецЦикла;
		
	ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиМатериаловНаСкладах Тогда	
		ИмяТабличнойЧасти  = "Материалы";			
		ИмяТаблицыОстатков = "ОстаткиМатериалов";
		
		тбзОстатки = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
		тбзОстатки.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.упСклады"));
		Для каждого Строка Из тбзОстатки Цикл
			Строка.Склад = Склад;
		КонецЦикла;
		
	ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиОборудованияНаСкладах Тогда		
		
		
		ИмяТабличнойЧасти  = "ДополнительноеОборудование";
		ИмяТаблицыОстатков = "ОстаткиАгрегатов";     
		
		тбзОстатки = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
		тбзОстатки.Колонки.Добавить("Склад",   Новый ОписаниеТипов("СправочникСсылка.упСклады"));
		тбзОстатки.Колонки.Добавить("Агрегат", Новый ОписаниеТипов("СправочникСсылка.упДополнительноеОборудование"));
		Для каждого Строка Из тбзОстатки Цикл
			Строка.Склад   = Склад;
			Строка.Агрегат = Строка.ДополнительноеОборудование;
		КонецЦикла;

	КонецЕсли;
	
	ДополнительныеСвойства.Вставить(ИмяТаблицыОстатков, тбзОстатки);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
